{"Sharon": [{"2009-01-05": []}], "Shelby": null, "Treasure": null, "Melissa": [{"2009-01-05": ["watching Melissa on the Bachelor", "Melissa on the Bachelor was also on Dallas Cowboy Cheerleaders.  I hate that. One is enough!", "@ms_melissa Nope. The Bachelor. Pretty much the same type though! :)"]}, {"2009-01-12": ["Bachelor Jason Mesnick Chooses Melissa at Final Rose Ceremony!: We all know that The Bachelor star, Jason Mesnic.. http://tinyurl.com/9w4fgs", "watching The Bachelor...go Melissa! And get rid of psycho hot dog lady..."]}, {"2009-01-19": ["Melissa is my favorite on the bachelor"]}, {"2009-01-26": ["I think \"the Bachelor\" is going to pick Melissa. That's my vote.", "On the Bachelor--Yay, Jason. Good move. I'm rooting for Melissa. Seems a good fit. The others...not at all. Deanna coming back too. Boo.", "I love Melissa on the Bachelor!", "RT @gibsondm: The Bachelor is still a train wreck...yet I keep watching it. - So true, but my vote is for Melissa!  or Jillian", "@kellierasberry hope you were able to watch the Bachelor. Rooting for Melissa.", "The girls on The Bachelor are starting to get really freaky, but I'm still going for Melissa!", "Lauren's ok....i still like Melissa the best for Jason \"The Bachelor\"", "getting ready to watch The Bachelor! Go Team Melissa!"]}, {"2009-02-02": ["Blog Spotlight: The Bachelor: Melissa Does Seattle http://twurl.nl/zp1txn", "Watching the Bachelor with my GF... go Melissa!", "so rooting for Melissa on the Bachelor...", "Re: the bachelor - I like Molly, Melissa and Jillian.", "I'm watching the Bachelor...  I think it's either going to be Molly or Melissa...  I'm hooked.", "Why does the Bachelor suck u in!!!  Im going with Melissa and I guess Molly will do!", "watching the Bachelor...yeah, go ahead & make fun of me. anyway, I think he should pick Melissa.", "#The Bachelor. I think Naomi is too young and Stephanie is too weird.  I like Melissa but Deanna is coming back. OY!", "melissa better win the bachelor!", "Watching the Bachelor. Go Melissa! in Hillview, KY http://loopt.us/Qkps7g", "Watching The Bachelor..Melissa is my favorite!", "watching the bachelor, routing for Melissa, or maybe Molly...", "Anyone else clued to watching The Bachelor? Who do think will be Jason's lucky lady? My bets are with Melissa.", "Gearing up for the bachelor- go melissa"]}, {"2009-02-09": ["asserts that 'The Bachelor' picks Melissa. In the engagement video, the girl wears a gold pinky ring - Melissa has a gold pink ring. The end", "Ok... Yesterday was really tough from top to bottom.  The Bachelor helped (Melissa), and today I'll watch 24 and maybe go hit balls...", "Confession: I just read a few posts on The Bachelor message board. I like Melissa, but others sure don't.", "think i enjoyed the bachelor toooo much tonight.  inside i kept chanting melissa. pick melissa! lame i know :)", "@melissaluvsDMB Hey Melissa :), lots of great shows tonight, The Bachelor, Big Bang Theory, 2 1/2 Men, Medium.", "I'm so happy that Melissa on the Bachelor is safe another week!", "thinks 'The Bachelor' is going to pick Melissa... Yes, I watch the Bachelor...", "Thinking Melissa and Jillian are definitely final 2 on The Bachelor.", "MELISSA wins the Bachelor... RT: Wow.  Do you guys believe this Bachelor Spoiler vid? http://tinyurl.com/dawea5 Seems legit #bachelor", "Check it out -  - http://tinyurl.com/d57z27 - Melissa from the #bachelor was on another reality TV show... Dallas Cheerleaders try-outs", "Melissa and Jason from the bachelor are presh ...I am going to be heartbroken if he doesn't give her a rose!", "Alright I think I'm now rooting for Jillian for the Bachelor!  I'm anxious to see what it's like at Melissa's though.", "Wrap it up Obama, its past time for The Bachelor! Excited about the hometown dates tonight! Go Team Melissa!", "just wrapped up supper & clean-up, now time to fold laundry & watch The Bachelor.  I'm rooting for Melissa, my fellow Texas gal!", "@ChelseaDomschot I can't wait for the bachelor tonight! Go Melissa!", "@linds16 Ah.. but the bachelor is on tonite!  What will Melissa do without Jason seeing her family????  drum roll!"]}, {"2009-02-16": ["Watching one tree hill!!! And then going to watch the bachelor! GO MELISSA! boo molly", "Spent 2 hours on trainer in zone 2 last night watching The Bachelor...crap tv..two decent choices, I suggest Melissa from TX.", "What's Melissa parent's story on The Bachelor?", "@virtualassist73 - Are you speaking about The Bachelor? I'm thinking it'll be Melissa...but maybe Deanna!", "BTW, in the first few previews of the Bachelor, they showed him with a brunette on the finale. Melissa or Deanna???", "The Bachelor is ridiculously addicting. Melissa needs to gtfo asap.", ": watching the bachelor. Team melissa !", "Honestly Jason. are you kidding me?  You're going to pick Melissa? The child?  grrr. hate #thebachelor", "@michaeleckford had a caller call in this aft saying jill didnt make it and the winner is melissa. wtf? #thebachelor", "I'm in love with the Bachelor! Melissa all the way!", "Jason Mesnick is definitely going to choose Melissa on The Bachelor.  It's not even close.  Jason gives too much away.", "No More Struggle----Check out the Bachelor on TV tonight.\nWho do you think he will choose??  Melissa is my guess.", "is sad Jillian was sent home but knows Melissa is going to win!!!!!!!!!!!!! (and yes, I AM talking about The Bachelor!!)", "He's totally gonna pick Melissa (The Bachelor)!!", "watched Jillian go home tonight on the bachelor-i felt bad for her, however, I'm one step forward to winning my $5.00 bet! Go Melissa!", "the bachelor is on in fifteen minutes. team melissa. so glad naomi is gone, dnw. school tomorrow!! 7am, hollla.", "Is rooting for melissa to win the bachelor", "I hope he picks melissa on the bachelor!!!!!!! She's been my fav since the beginning. I am going to punch him in the face if he picks molly.", "totally blown away by the bachelor. i would have sworn up and down that molly was going home. i'm still all about MELISSA, though.", "pondering the Bachelor, wondering who Jason is going to chose to be his wife.  I think I'm leaning towards Melissa now.", "Yeaaaaahoooo, Jason picked Melissa as one of his top two!  Send Jillian home, crazy man.  Not that I watch 'The Bachelor' or anything.", "So, Molly and Melissa get a rose tonight on the Bachelor. Check out the recap of our live blog. http://blog.mlive.com/goinggonzo/", "Oh my... Melissa or Molly... I can't decide.  Molly doesn't seem like a stepmom though.  The Bachelor... reels me in EVERYTIME.", "is happy melissa got to stay on the bachelor.. yay dallas girl! & remember lip sync for your life! ahahaha...", "I can't wait two weeks for the bachelor finale!!!! I think Melissa and Jason get married right there on the spot!", "Yessss! :)) I love the bachelor. Team melissa!", "OMG...is anyone else watching the bachelor? Can you believe he chose ditzy melissa over Jillian?", "Melissa on The Bachelor is hot. Shame I can't protect her from what's coming....", "Aaww!!! I really hope Melissa stays on the Bachelor tonight.....oh the anticipation :{", "Watching the Bachelor. Who do you think will go home? We are projecting Melissa. Not sure he \"loves\" any of them.", "jason + melissa = love #thebachelor awwww", "Melissa's voice sounds younger and younger everytime she speaks.  Now going on 5.  #TheBachelor", "watching the bachelor - hope he picks Melissa", "not a fan of melissa's dress :( #thebachelor", "watching the Bachelor! Go Melissa...", "Watching 'The Bachelor,' and kinda loving it. I think he'll choose Melissa or Molly.", "Watching the Bachelor and Melissa's parents can get ready to greet her at the airport. I think she's going home.", "melissa bores me (yeah, I admit it, watching the Bachelor)", "Watching The Bachelor...please kick off Melissa- PLEASE!", "Watching the Bachelor...hoping Melissa makes it another week!!", "About to watch Jason make a terribly difficult decision on The Bachelor! Still pulling for Jillian, Melissa & Mollie in that order.", "#thebachelor Melissa and the Jillian in the final two and the Canadian will bring it home", "watching the season finale of the bachelor. I hope he picks Melissa! :)", "Live Blog of ABC's 'The Bachelor:' Will Jason Mesnick pick Molly Malaney, Melissa, Jillian or -- gasp! -- DeAnna.. http://tinyurl.com/arudp3", "Jason Mesnick Overnight Dates on The Bachelor – Which Lady will get Lucky?: Melissa, Molly and Jillian. Three wo.. http://tinyurl.com/cjzxed", "Lookin forward to the bachelor tonight!!!!  Melissa all the way!!", "Getting a couple's massage and then watching The Bachelor. Go Melissa, and not (just) because I win if you win . . .", "So excited for the bachelor tonight.. I think melissa is out. You?", "Catching up on the bachelor! I hope he picks Melissa!!"]}], "Molly": [{"2009-01-05": ["for all you fans of The Bachelor, look for my cutie sorority sister Molly (blue strapless dress) -- she's the best!", "Grand Rapids girl Molly Malaney just received a rose at first rose ceremony of this season's The Bachelor. Now I can turn to Fiesta Bowl.", "Molly from the bachelor totally rocked the Michigan accent.", "One of my sorority sisters (Molly Malaney) is one of The Bachelorette's on new season of The Bachelor (starts tonight). Hahaha"]}, {"2009-01-12": ["RT @GRGonzo Molly Malaney of Grand Rapids & The Bachelor is a good kisser. http://tinyurl.com/7wppfx ::: ROFL. Yeah CC Grads. (via @umtrey)", "RT @GRGonzo Molly Malaney of Grand Rapids & The Bachelor is a good kisser. http://tinyurl.com/7wppfx ::: ROFL. Yeah CC Grads.", "Molly Malaney of Grand Rapids & The Bachelor is a good kisser. http://tinyurl.com/7wppfx", "Molly and Megan are going to fight....#TheBachelor #no24"]}, {"2009-01-19": ["watchin' my cute lil' sorority sister Molly on The Bachelor..."]}, {"2009-01-26": ["@kaye BUT my friend is on the bachelor this season (Molly!) so I watched that instead. Do you watch at all?", "The Bachelor says GR's Molly has ''stargazing amazing'' eyes. http://tinyurl.com/abwtkz", "Roommate and I are watching The Bachelor. My $$ is on Molly and I'm trying to get Roommate to apply to be on the next Bachelorette.", "Spoiler Alert: I LOooVVEEE that Molly is the only gal to do the walk of shame on \"The Bachelor\" thus far", "Watching the Bachelor and thinking Jason really likes Molly."]}, {"2009-02-02": ["though i hate to admit i'm still watching the bachelor, he's making (mostly) smart choices. i pegged molly, mel and jillian from the get-go.", "YAY, Heroes...about time! And yay to the top four of the Bachelor--for once, I like them ALL (though rooting for Molly or Jillian)!", "Love love loves Molly from The Bachelor, yep, I've casted my vote.", "Re: the bachelor - I like Molly, Melissa and Jillian.", "Molly is hands down the best on The Bachelor.", "it freaks me out how much molly from the bachelor looks like katherine sharkey. seriously. so weird!", "I'm watching the Bachelor...  I think it's either going to be Molly or Melissa...  I'm hooked.", "Why does the Bachelor suck u in!!!  Im going with Melissa and I guess Molly will do!", "watching the bachelor! get rid of Molly! and Naomi! and Jillian!! haha", "watching the bachelor.  molly is a hooch & a half.", "A girl that lived on my dorm floor at IU is on the bachelor, Molly.  I'm checking out a bit of it as lame as that sounds.", "watching the bachelor, routing for Melissa, or maybe Molly...", "watching the bachelor and rooting for Molly!"]}, {"2009-02-09": ["http://twitpic.com/1eyir - I was lookin' at old pics and remembered I had a pic of Molly from The Bachelor - she is just too darn cute!", "Wow. I'm seriously addicted to the bachelor. Go Jillian and Molly from Grand Rapids and IU whooo hooo!", "Watching The Bachelor with my wife. This Molly chick bugs.", "Watching my guilty pleasure...The Bachelor! GR's own Molly made a stellar showing. I know a great wedding planner should she need one! :)", "Watching Molly Malaney and her family on The Bachelor. This is weird.", "Watching the bachelor. He comes to Grand Rapids in this episode with Molly. http://tinyurl.com/b9mdo5", "OK, haven't been watching the Bachelor this season, but sis @JulieJames is addicted & at my house watching it. She likes Molly #the Bachelor", "It's a quiet night. Making Tacos, watching the Bachelor (go GR Molly!), and working on finishing chapter 3 of my novel.", "Watch the Bachelor tonight! Jason makes visit to Grand Rapids for a date with hometown girl, Molly Malaney! Will she get a rose?"]}, {"2009-02-16": ["still pretty pissed that the bachelor kept Molly! UGH!", "Watching one tree hill!!! And then going to watch the bachelor! GO MELISSA! boo molly", "Heard any rumors on \"Milwaukee's Molly\" from \"The Bachelor?\": Molly Malaney, a Grand Rapids, Mich., native and M.. http://bit.ly/5hVN2", "Grand Rapids native Molly Malaney makes final two on 'The Bachelor' http://bit.ly/165LPT", "Grand Rapids native Molly Malaney makes final two on 'The Bachelor': Molly Malaney's \"leap of faith\" in bungee j.. http://tinyurl.com/cs5t9p", "He didn't pick Jillian!  How could he pick the prom queen bitch Molly.  Oh well, Jillian was too good for this show.  #thebachelor", "FF to try to catch up with PST peeps on the Bachelor. Made it up to Molly on the bridge.  AS IF she's not going to jump. #bachelor", "if you're on the bachelor, you get to go to New Zealand. If you're not, you get to watch retarded Molly go. Jillian is ok.", "I hope he picks melissa on the bachelor!!!!!!! She's been my fav since the beginning. I am going to punch him in the face if he picks molly.", "totally blown away by the bachelor. i would have sworn up and down that molly was going home. i'm still all about MELISSA, though.", "So, Molly and Melissa get a rose tonight on the Bachelor. Check out the recap of our live blog. http://blog.mlive.com/goinggonzo/", "Oh my... Melissa or Molly... I can't decide.  Molly doesn't seem like a stepmom though.  The Bachelor... reels me in EVERYTIME.", "i see why they didn't show molly and jason making out now.  hilarious! #thebachelor", "@Cuprisin You are hilarious. Glad to see a reporter enjoys the Bachelor as much as I do. I think Milwaukee Molly will end up with a ring :-)", "@daphillips watching the bachelor with molly????????", "Goodnight all. I am going to finish watching The Bachelor then headed to bed. I predict it will come down to Molly and Jillian.", "@SMILINandSTYLIN i'm calling molly #thebachelor", "watching molly on the bachelor and writing 3 papers. ugh.", "watching The Bachelor! I love this show. I like each of the girls except Molly- I am so curious to see the outcome!", "Watching 'The Bachelor,' and kinda loving it. I think he'll choose Melissa or Molly.", "#thebachelor two words molly: train wreck. After that convo, you are totally going home tonight.", "geez, i feel like jason was going to sit there until molly said she was falling in love #thebachelor", "Molly + Jason = awkward #thebachelor", "anybody just notice how Molly on the Bachelor just left her purse behind after the bungee jump lunch date?  why does this bother me?", "watching the bachelor: i like molly!", "Cheering Molly on as i watch The Bachelor!", "\"Listening\" to The Bachelor as my bride watches to see if a local girl (Molly) makes it through. I'm on my Powerbook (obviously).", "I hope Molly goes home on #TheBachelor", "Back to twittering. Watching the bachelor (yes, I know), thinking Molly will win.", "Ready for the Bachelor.  Who is going home tonight?  Me thinks Molly.  Opinions anyone?", "Live Blog of ABC's 'The Bachelor:' Will Jason Mesnick pick Molly Malaney, Melissa, Jillian or -- gasp! -- DeAnna.. http://tinyurl.com/arudp3", "Jason Mesnick Overnight Dates on The Bachelor – Which Lady will get Lucky?: Melissa, Molly and Jillian. Three wo.. http://tinyurl.com/cjzxed", "Pizza and the Bachelor. Might be the perfect Monday night. And I think Jason would be wise to send Molly packing. Just my prediction...", "Please send Molly home tonight.  There, I admit it.  I accidentally (and pathetically) started watching (and caring about) The Bachelor.", "taking bets on who's going home on the bachelor tonight. my money's on molly going home. a good reason to let my class out an hour early!", "Off to switch the laundry and cook dinner.  Only 3 hours until the Bachelor.  Buh-Bye Molly!!!"]}], "Megan": [{"2009-01-05": ["Am I the only one who thinks Megan (the one with the 14mo) on the Bachelor looks like Peg Bundy?"]}, {"2009-01-12": ["My friend Megan is on the Bachelor. She is a trainwreck. Should be entertaining.", "Molly and Megan are going to fight....#TheBachelor #no24"]}, {"2009-01-19": ["Felicia Matlosz: \"The Bachelor:\" Jason keeps Megan and the stalker? http://tinyurl.com/9l753b", "just finished The Bachelor and am headed to bed. Jason is such a peach however I'm baffled as to why he kept Megan? Night All!", "Is it me or does megan from the bachelor look like she's 40?", "Ahem, why oh why did Jason just give Megan a rose on The Bachelor? Huh? Are you kidding me? She looks so obviously like a bword all the time", "Will Sewickley Hills native Megan Parris get a rose on tonight's episode of \"The Bachelor\"? Read Thursday's Herald for a weekly update."]}], "Renee": null, "Natalie": [{"2009-01-05": ["Watching The Bachelor until I hear Clayton's key in the door. He'll never know it wasn't the Fiesta Bowl on this whole time."]}, {"2009-01-12": []}], "Stacia": null, "Jackie": null, "Erica": [{"2009-01-05": ["blames Facebook for now having to watch \"The Bachelor\" and see \u0001how far Erica gets."]}, {"2009-01-12": []}], "Lisa": [{"2009-01-05": ["Enjoyed co-worker Lisa's network TV debut on 'The Bachelor' earlier tonight.  Best.  Soundbite.  Ever.", "We're watching the bachelor after the fiesta bowl.  This show makes me want to puke."]}], "Stephanie": [{"2009-01-05": ["Stephanie on the Bachelor has scary botox forehead and eyebrows, but quite a story. And boobs! gosh, the boobs are everywhere on this show.", "Watching The Bachelor. If stephanie has NOT had face work done, I will eat my hat."]}, {"2009-01-12": ["Hot Slut Of The Day! : Stephanie - The woman with the most gorgeous eyebrows from The Bachelor! Stephanie's eyeb.. http://tinyurl.com/8d3vsl", "I would NOT miss The Bachelor next week for ANYTHING! Did you see the preview? What a great gift for Stephanie, & those jewels for THE date!", "Ahh, moving on to The Bachelor. Stephanie: \"I want him to know I have a heart that's beating inside...\" Yeah, unlike those ZOMBIE BITCHES.", "Watching The Bachelor and hoping that Stephanie from Huntsville, AL gets to stay around forever. She ROCKS (in a classy way)"]}, {"2009-01-19": ["Watching The Bachelor. I think I like Stephanie the best. But even she is weird.", "Had a good workout despite the gym being so crowded.  Now I'm going to watch The Bachelor. I love to hate Stephanie, so I hope this is good.", "Awww! The bachelor brought the widow's Stephanie's daughter on the show for her birthday. I am so fahklempt!", "THE BACHELOR!!! rooting for Stephanie :)"]}, {"2009-01-26": ["Stephanie on the bachelor looks like Patrick Swayze cross dressing!", "Watching tonight's episode of The Bachelor with my wife. I'm convinced Stephanie is a robot.", "Yeah Stephanie on the Bachelor..... now why do I watch this stuff?", "RT @Heather_Poole: Sorry, but there is no way that Stephanie on the Bachelor is 34! Maybe 44!!!!", "Sorry, but there is no way that Stephanie on the Bachelor is 34!", "watching the bachelor...i hope he keeps stephanie!"]}], "Lauren": [{"2009-01-05": []}, {"2009-01-12": ["Okay that girl Lauren on the bachelor is killing me.", "Watching the Bachelor.  Hope Shannon is not much of a stalker tonight.  Go Nikki or Lauren (as of now)"]}, {"2009-01-19": []}], "Dominique": null, "Jillian": [{"2009-01-05": []}, {"2009-01-12": ["Watching \"The Bachelor\"... Jillian is my early fave, so far!", "watching the Bachelor. I think Jillian should win. she designs restaurants and I think that's cool."]}, {"2009-01-19": []}, {"2009-01-26": ["RT @gibsondm: The Bachelor is still a train wreck...yet I keep watching it. - So true, but my vote is for Melissa!  or Jillian", "watching the bachelor with the girls-- team jillian!"]}, {"2009-02-02": ["though i hate to admit i'm still watching the bachelor, he's making (mostly) smart choices. i pegged molly, mel and jillian from the get-go.", "YAY, Heroes...about time! And yay to the top four of the Bachelor--for once, I like them ALL (though rooting for Molly or Jillian)!", "Need another reason to watch The Bachelor? BCIT grad Jillian makes it to the final 5...not that I'm watching...http://tinyurl.com/ckb5rp", "Re: the bachelor - I like Molly, Melissa and Jillian.", "watching the bachelor! get rid of Molly! and Naomi! and Jillian!! haha", "Watching The Bachelor... go Jillian!", "RT @bcit BCIT Interior Design grad on the Bachelor! Who knew? Good luck to Jillian.  RT » link to edmontonsun.com", "BCIT Interior Design grad on the Bachelor!  Who knew?  Good luck to Jillian. http://tinyurl.com/ckb5rp"]}, {"2009-02-09": ["\"Life is a dance, you learn as you go.\" Thanks Jillian's mom from the Bachelor! lol! :)", "So, I have to ask: Who do you guys like best on The Bachelor?  Who do you think will win?!  I LOVE Jillian! #bachelor", "thinks Jason should pick Jillian on the Bachelor....", "Re The Bachelor: Jillian's mom read a poem saying she hoped they 'fly like a dove' right before an *actual dove* crashed & died. Ha! Irony.", "@VDog: my money is on Jillian's Granny to win The Bachelor.  What say you?", "Watching The Bachelor with @rosebraun. She is getting nervous excited for Jillian. Hometown dates episode.", "Wow. I'm seriously addicted to the bachelor. Go Jillian and Molly from Grand Rapids and IU whooo hooo!", "Watching the bachelor- choose jillian!! And enjoying the rum Kyle got for me. Yay marriage!!", "so i really want jillian to win the bachelor, not bc shes canadian but bc i think mollys boring and melissas too young :)", "Thinking Melissa and Jillian are definitely final 2 on The Bachelor.", "Addicted to the bachelor!! Go Jillian!", "Rooting for Jillian on The Bachelor.  Such a guilty pleasure", "Alright I think I'm now rooting for Jillian for the Bachelor!  I'm anxious to see what it's like at Melissa's though.", "I love Jillian's family on the Bachelor. Cute!", "On the Bachelor I choose Jillian for Jason.", "Watching The Bachelor because I've got such a busy life, lol.  Pulling for Jillian though.", "I love Jillian's Canadian accent. Yes, I am watching the Bachelor and no, I don't need your judgment", "omg jillian... mission hill on the bachelor. this hits too close to home..", "Excited for The Bachelor tonight...particularly Jillian's hometown date.  I'm a reality TV nerd.", "is waiting anxiously for the Bachelor to start... go Jillian!  don't judge me."]}], "Ann": null, "Raquel": [{"2009-01-05": []}], "Shannon": [{"2009-01-05": ["Any thoughts on the Bachelor?  Can I say Shannon was a whack-job and he kept her yikes!", "I just finished watching The Bachelor....I'm making my prediction....I think he chooses Shannon! Check out my blog for full reasoning."]}, {"2009-01-12": ["O.M.Gosh... Shannon (on The Bachelor) has GOT to go!  They girl is whacked!", "The Bachelor is ON, these ladies are Nutz, lol...too funny.  Shannon's teeth bother me and all their Orange tans", "Watching the Bachelor.  Hope Shannon is not much of a stalker tonight.  Go Nikki or Lauren (as of now)"]}, {"2009-01-19": ["Shannon from The Bachelor is still a stalker...... Weird!"]}], "Naomi": [{"2009-01-05": []}, {"2009-01-12": []}, {"2009-01-19": []}, {"2009-01-26": []}, {"2009-02-02": ["Not Stephanie!!! The bachelor is a bafoon. Now I have NO idea who he's gonna go for. As long as he doesn't pick Naomi I'll be happy.", "By the way I am watching The Bachelor and as Naomi would say \"like totally\"", "Tuned into the Bachelor late. What's Naomi's big secret?", "watching the end of the Bachelor. I hope he ousts Naomi or the canadian girl. The other three are the best for him.", "watching the bachelor! get rid of Molly! and Naomi! and Jillian!! haha", "#The Bachelor. I think Naomi is too young and Stephanie is too weird.  I like Melissa but Deanna is coming back. OY!"]}], "Kari": [{"2009-01-05": []}, {"2009-01-12": []}], "Julie": null, "Nicole": null, "Emily": null}